import serial
import pylab
import pyqtgraph as pg
from pyqtgraph.Qt import QtWidgets
import numpy as np
# -------------------------------------------------------------------------------------------------------
f = open("textEA.txt", 'w')  # открываем файл для ЗАПИСИ
# -------------------------------------------------------------------------------------------------------
# r = serial.Serial(port='/dev/ttyUSB0', baudrate=9600, timeout=1)
# -------------------------------------------------------------------------------------------------------
r = serial.Serial('COM5', 115200)
# -------------------------------------------------------------------------------------------------------

# -------------------------------------------------------------------------------------------------------
b = bytearray()
tlist = []
ulist = []
i = 0
c = 0
e1 = 0
j = 0
# -------------------------------------------------------------------------------------------------------



# -------------------------------------------------------------------------------------------------------
for i in range(1, 2000, 1):  # кол-во снимаемых значений(цикл for предпочтительней)
    # -------------------------------------------------------------------------------------------------------
    b = r.read(3)  # читаем по 3 байта
    e2 = i;  # фиксируем время приёма данных
    # -------------------------------------------------------------------------------------------------------
    c = (((b[0] & 1) << 9) | (b[1] << 1)) | (
                (b[2] >> 7) & 1)  # из полученных 3х байт формируем 10ти битное число (для MCP3008)

    # -------------------------------------------------------------------------------------------------------

    # -------------------------------------------------------------------------------------------------------
    if j < 3:
        j += 1
    else:
        j = 0
    if j == 0:
        print(c)
        f.write(str(c) + ' ; ' + str(e2) + '\n')  # пишем 10ти битное число и время приёма числа через ";"

# -------------------------------------------------------------------------------------------------------
f.close()  # закрываем файл
# -------------------------------------------------------------------------------------------------------

# -------------------------------------------------------------------------------------------------------
# открываем txt файл для ЧТЕНИЯ и строим из него график
f = open("textEA.txt", 'r')
for line in f:  # читаем данные из txt построчно
    a = line.split(';')  # делим текущую строку на 2 подстроки: "значение" и "время"
    a1 = int(a[0])  # приводим типу int "значение"
    a2 = float(a[1])  # приводим к типу float "время"
    tlist.append(a2)  # пишем в list последовательность ti...
    ulist.append(a1)  # пишем в list последовательность Ui...
f.close()
# -------------------------------------------------------------------------------------------------------
pylab.plot(tlist, ulist);  # строим график
pylab.xlabel('t,sec');
pylab.ylabel('o.e..');
pylab.ylim(0, 1024);
pylab.grid();
pylab.xticks(range(30));
pylab.show();  # выводим график
# -------------------------------------------------------------------------------------------------------
